const xiaoHua=[
'xxx期：和儿子去游泳，儿子看了眼我，说道：妈妈，我终于知道为什么你会游泳了，我身上只有一个游泳圈，而你有三个！',
'xxx期：单位让交一张照片，某人把一张两寸照交上去。主管说照片太大了，换张小的来。某人换了照片上交，被臭骂一顿：“让你换成一寸照，你拿百日照是什么意思？”',
'xxx期：亨利的妻子临睡前絮絮叨叨的谈话令他十分不快。一天夜里，妻子又絮叨了一阵子后，问亨利：“家里的窗门都关好了吗？”亨利回答：“亲爱的，除了你的话匣子外，该关的都关了。',
'xxx期：和儿子去游泳，儿子看了眼我，说道：妈妈，我终于知道为什么你会游泳了，我身上只有一个游泳圈，而你有三个！',
'xxx期：上初二的时候和三个好哥们儿成立了一个青龙帮，后来不知咋的被班主任给万现了，硬生生地被改成了青龙学习小组……',
'xxx期：那天晚上宵夜，女朋友想吃鸭头陪她去买，店主说三元一个，女朋友说十元三个卖不卖！店主对我说：兄弟，这美女不是你媳妇吧，你以后可千万给她掌钱啊！',
'xxx期：妻子怀孕三个月，一天肚子不舒服，丈夫带她去医院检查。医生问，最近有没有同房，丈夫马上回答说没有。医生说，别打岔，不是问你，是问你媳妇。丈夫纳闷，这是怎么个意思？',
'xxx期：以前流行纹身，一哥们就在背上纹了一副中国地图。有一天脊背疼得去医院了，医生问：你哪里疼？他幽幽的来了一句：在扬州附近…',
'xxx期：昨夜，路边摊，6个11岁左右的小盆友，10来瓶啤酒，喝的精光，山盟海誓，痛哭流涕，原来是小学毕业了，恋恋不舍，靠，现在的娃肿么了?','大街上，一对情侣吵架，女人一气之下抽了男人一耳光。男人大声嚷道:“有本事再来一巴掌?”女人毫不犹豫的又打了一耳光。男人顿了顿，牵起女人的手:“既然你这么听话，不吵了，回家吧”',
'xxx期：读小学的儿子改了QQ签名:“先是期中考试，再是家长会，然后是光棍节，这就是事业、亲情、爱情的全面崩盘的节奏吗?!!” 尼玛现在的熊孩子脑子里都在想什么?',
'xxx期：我一素来以文静著称的女同学，今天上午正好撞破男友劈腿，姑娘上前质问，男友不仅大放厥词还想动手打人。姑娘含怒出一拳，男友倒地送医，下颚骨骨裂。据说姑娘家传形意拳，习练多年，拳下三五大汉不得近身。我刚去看她QQ签名，已从“今天北京风好大”改成“有朝一日剑在手，杀尽天下负心狗”',
'xxx期：小雷偷偷溜进小树林，准备做些自娱自乐的事情，忽然金光一闪，一个穿着奇装异服的男子出现在眼前。看到小雷提着裤腰带被惊呆的样子，男子安慰他说:“别害怕，我是来自未来的。”“那我就放心了，”小雷松了一口气，“我也是来自慰来的。',
'xxx期：和朋友去玩，有那种鬼屋，有真人扮演的。我胆子比较小很快跑出来了，等半天不见我朋友。我往出口那一看，这二货一边抽烟一边和鬼聊天:兄弟，你一个月多钱?鬼答:没多少没多少。',
'xxx期：今天打篮球中，朋友说:我练腹肌去了。马上来另一个朋友大声叫到:拉屎就拉屎，还特么装文艺。。。',
'xxx期：听人说榴莲核熟了可以吃，跟栗子一样的味道，于是，我把榴莲核放微波炉转了几分钟。尼玛!厨房瞬间变茅房啊。。。次奥!哪SB说的!!',
'xxx期：“是110吗?”“不是的，老人家。这是119”“哦，我想找火警…”“火警找我们就对了，老人家，发生什么事了?”“我家老头子不知哪来的火气，发疯似的，我都治不了他了!”“这个…这种情况您还是找110吧”“他把被子点着了…”“…”',
'xxx期：和朋友在微信上聊天:“人生有很多事是无法控制的。 ”“比如说呢?”“找呀找呀找朋友，找到一个好朋友，敬个礼，握握手，你是我的好朋友。”“什么意思?”“你能控制住自己在读这段歌词的时候不在心里把它唱出来吗?”” 。。。看到这，我顿时长跪不起。',
'xxx期：我的一室友是个神经大条。一天，这位室友早早起来，半梦半醒地拿着牙膏正准备刷牙，还躺在床上的另一哥们儿瞄了他一眼问道:“这么早就起来洗头啊?”这位室友“嗯”地应了一声，然后把牙膏挤头上开始洗头了……','化学课上，有一女生对白色和透明区分不了。老师讲解了好多遍，拿着试管，说这是透明的，墙壁是白色的，然后问那女生试管是什么颜色，那女生依旧说白色，老师暴怒，指着试管说：好，明天你就给我穿这种白色的裙子来上课',
'xxx期：马上又到年关了，出门的时候妈妈叮嘱我，小心有坏人盯上我。我说：放心吧，坏人打不过我。妈妈说：我是怕坏人看到你的兜都笑话你',
'xxx期：以前的时候，大学寝室6人一间，有一天舍友去献血，送了一箱纯牛奶，然后回来宿舍人喝，一个礼拜喝完了。宿舍一个奇葩说，那谁没课了再去献点血去，寝室的奶可喝完了啊！',
'xxx期：我对当年暗恋的同学说：“你知不知道为什么以前下课的时候，我总是找你问问题吗？”大伙儿就起哄，等着看她脸红。她平淡地看了我一眼，抿了抿嘴角道：“那你想过没有，为什么我总是会在座位上，而不出去玩呢？”',
'xxx期：跟女朋友逛街，女朋友突然来了尿意，就带女朋友去了路边的公厕，在门口听见里面有一些喘息声。然后我和女朋友没敢太声张就听了一会，然后女朋友憋不住了，就咳嗽了一声，结果里面的人说了句：别误会，我便秘',
'xxx期：同事生了娃，我问：郑哥，你儿子叫什么名字？他说：郑再起。我说：是东山再起的那个再起吗？他说：是正在起名字，还没起好。。',
'xxx期：一男子被朋友一把抓住，问他是不是张三。张三：我是，您是哪位啊？朋友：这给您的红包您先拿着。以前啊，我追过你老婆，她说就是嫁条狗都不会嫁我，我这不是来看看你吗',
'xxx期：同学聚会，有人吹500万被套了，有人说拿2000万补仓了，还有人感叹老婆6000万基金赔了，这时一同学打电话给其父：“老爸，别打高尔夫了，你把沪指拉起来吧，我同学都赔钱了！”这时老板娘进来了：“都别吹了，我们饭店手机没信号，五碗拉面，谁给钱？”',
'xxx期：我们班里来了一个新老师，让我们一人写一篇个人介绍。老师看到我们写的之后站在讲台上问：人最重要的是什么？是诚信啊，对不对？同学们回答：对。然后，老师说道：那好，现在请在自我介绍中写自己能胸口碎大石的同学上台表演一下，请脚踩灯泡的同学做准备 ！！！',
'xxx期：在山东上大学时追过一女孩，数次表白，均无应答。终有一天，女孩短信告知我，周末去公园玩玩吧。我激动得晚上没睡好觉。周末应邀到黄河公园。走了一阵，女孩说，我有句话一直想对你说…我那个激动啊，心想这事有戏，就说，你说吧，我听着。她随后一句话差点让我背过气：“黄河也看了，这回死心了吧！”',
'xxx期：一天，8个人聚在一起吃饭，席间上了一道红烧熊掌，朋友们相互推让谁也不好意思先吃。这时候不知谁把灯关了，然后就听到一声惨叫，大家打开灯一看，只见熊掌上有一只手，手上插了7把叉子',
'xxx期：大学毕业，到处找工作，却一直没有被录取，5岁的侄子对小叔说：叔叔你去做人流啊！小叔：为什么？？？侄子：今天做人流，明天就可以上班。电视上就是这么说的。。。。。（广告时间严禁插播电视剧）',
'xxx期：结婚第一年，妻走路撞树，夫：撞哪了？撞坏了吧，疼么！七年后妻走路再次撞树，夫：你眼睛长裤裆里了，你瞎啊你！',
'xxx期：早起，买地沟油油条,切个苏丹红咸蛋，冲杯三聚氰氨奶，上班。中午，在食堂要一瘦肉精猪肉吃炒农药韭菜和双汇香肠，来碗翻新陈米饭，泡壶香精茶叶。下班，买条避孕药鱼，尿素豆芽，膨大西红柿，开瓶甲醇酒，吃个硫磺馒头。饭后地摊买本盗版小说，晚上钻进黑心被窝，今天是多么愉快的一天！',
'xxx期：今天给3岁的女儿洗澡，刚把女儿放进澡盆，女儿就大喊：妈妈快来，爸爸泡妞啦。',
'xxx期：初中生的爱情：一起回家； 高中生的爱情：一起吃饭； 大学生的爱情：一起睡觉； 婚后的爱情：一起回家吃饭睡觉',
'xxx期：前年她17岁，她看到我的手机，说：“姐夫，你的手机不错！”回去的时候，她姐把手机给她带上了。去年她18岁，她看到我的笔记本后说：“姐夫，你的笔记本不错嘛！”回去的时候，她姐把笔记本给她带上了。今年她19岁，看到我后，害羞的说：“姐夫，其实你这人挺不错的。我在等她姐姐发话。',
'xxx期：老张提前下班回家，发现领导正和妻子偷情，他吓得赶紧跑回单位，叹道：好悬，差点被领导发现早退！',
'xxx期：胆小嘴笨的老张一日酒后仗胆审妻，妻抵赖说只有一次，老张指着妻子气愤地说，你，你谦虚',
'xxx期：老张思前想后将此事告知了领导妻子，领导妻子大怒，商量和老张一起报复他们，于是他们做了一次，二次，三次，到领导妻子要求第四次时，老张落泪了：不要来了吧，我，我，我已经原谅他们了',
'xxx期：一个男人心情沉重地在酒吧喝酒……服务生：先生，心情不好吗？有心事说出来听听嘛！男人：我是同性恋。服务生：那又怎样？男 人：我哥哥也是同性恋。服务生：……男 人：更糟的是，我弟弟也是。服务生：……难道你家没人喜欢女人？男人：有！我妹妹',
'xxx期：六岁的芳芳很可爱，常常被班上的小男生求婚。有一天，芳芳回家跟妈妈说：妈妈，我们班的小强又向我求婚。妈妈无奈的问：小强有固定工作了吗？芳芳想了想说：他是我们班擦黑板的……',
'xxx期：母亲：你这死丫头，才15岁就搞对象，整天不回家，连你母亲30岁生日你也不来！',
'xxx期：上学的时候，老师问我们的理想。有的同学要当科学家，有的要当老师，有的要当医生。只有我的理想是打工，当时同学都笑话我。老师说我没大出息，昨天几个同学小聚了一下。聊起同学们的现状，大家同时发现，只有我的理想实现了',
'xxx期：有一个忏悔者找到神父说：“我错了。”神父说：“不要紧，上帝会原谅你的。”忏悔着说：“我偷了一辆脚踏车,把它交给你.。”神父说：“不，不，你不要交给我，交给失主好了。”忏悔着说：“他不要。”神父说：“那你就收下吧。” 神父回家时，发现自己的脚踏车不见了',
'xxx期：某天上街，见一雷人车屁股写着：驾校开除，自学成才，租的车，买的证，没保险，刹车油门分不清，车祸33次，32胜1平，0败，其他车均闻风而逃。',
'xxx期：一对情侣，女朋友可怜巴巴地问道：“我们为什么不能住贵一点的房子？” 男说：“我们马上就要住贵房子了。房东说明天起给我们加房租。”',
'xxx期：“我饿了”是句很考验人的话.对妈妈说：我饿了.妈妈就会马上起身说：“我去给你弄吃的.”对爸爸说：我饿了.爸爸就会笑笑说:“好，我们到外面去吃。”对男朋友说：我饿了。他就会温柔的说：“想吃什么呢？”对女朋友说：我饿了。她永远会回答：“我也是”因此越来越多的男孩选择找个男朋友。',
'xxx期：哥们签名：孔子的父亲生孔子时已经快70岁了，而孔子的母亲才17岁。看来等我70岁的时候，也得找一个17岁的姑娘，生出一个孔子来……',
'xxx期：心跳定律：如果你吻一个女人，你的心跳达到250，那肯定是初恋。心跳达到180，那肯定是偷情。心跳达到120，那肯定是热恋。心跳达到80，那肯定是老婆。心跳达到30，那肯定是恐龙。心跳达到0，那肯定是心肌梗塞。',
'xxx期：哥们谈崩了一笔生意，被老板臭骂三个小时，身心俱疲地回到家里，见到桌上留着一张妻子写的纸条： “汽车在修理厂，晚饭在《大众菜谱》第17页，做饭材料在华联超市，我在酒吧',
'xxx期：日本福岛核电站爆炸后核辐射云腾空而起，然后：中国新闻说，风是往美国吹的，美国新闻说，风是往中国吹的，韩国新闻也说，自己很安全。这风到底是往哪里吹的？风表示自己压力很大，不知道该往哪吹？仔细想后很纠结的说：既来之则安之，还是回娘家看看，去美国吧!”',
'xxx期：车站碰到个要饭的，他手里拿着一张纸，写着：我是一个聋哑人，请你施舍一点给我。我怀疑他是骗子，于是我就说了一句：对不起，我不认识字。然后他就开口说话了：兄弟，我的钱包被人扒了没钱买车票回家了，你借我点钱吧。我惊讶：你不是聋哑人吗？他也很吃惊：你不是不认识字吗？',
'xxx期：跟朋友聊天，聊起每个学校旁边都有一个洗浴中心，朋友思索了一下，说，这到底是为了方便消费呢还是方便兼职呢？',
'xxx期：一个独眼人不慎把自己的假眼球吞进了肚子，假眼被卡在了肛门里，怎么也弄不出来，于是他就去了医院。大夫在检查的时候被吓晕了，醒来的时候他说了一句话：我看了一辈子肛门，没想到今天被肛门看了一眼。',
'xxx期：邮递员蹬了很久的自行车把一封生日贺卡送到护林员手里，他喋喋不休的抱怨这个地方是多么的偏僻，护林员实在忍不住了：你再不闭嘴，我就要订报纸了！',
'xxx期：说某工科类大学，某同学的QQ签名是：远看一座庙，近看咱母校，三百多尼姑，一万多老道',
'xxx期：独自坐在电脑前，看书看电影写东西，写着写着忽然觉得如此孤独。开一瓶可乐，泡沫涌出来洒了一桌子，气氛顿时更加悲凉。我一边喝一边哭，一边喝一边哭……猛然看到瓶盖上写着“再来一瓶”，擦，社会怎么能这么残酷，连伤心都不让人好好伤心！！！算了，我先去领奖了……',
'xxx期：小姑娘们梦中都想找一匹白马，睁开眼发现满世界都是灰不溜秋的驴，悲痛欲绝后，只能从驴群中挑个身强力壮的，这样的驴就被命名为：经济适用男',
'xxx期：一次朋友带老外去吃乌骨鸡（通体黑色的鸡），老外没见过，朋友就给他介绍，并说这种鸡营养价值更高，怎么怎么的，老外微笑着问：“这是。。。。非-洲-鸡-吗？”',

'xxx期：与禽兽搏斗的三种结局：赢了，比禽兽还禽兽；输了，禽兽不如；平了，跟禽兽没两样。 结论：选择正确的对手最重要！',

'xxx期：老师说：“大家都应该听过，医学上把‘痛’分为十二级。”“第一级是指被蚊子叮咬程度的痛，”“第十二级也就是最痛的一级，那就是女人在生产时的痛。”此时，有人举手问道：“老师，那有没有第十三级的痛？”另一个学生主动回答：“就是女人在生产时，被蚊子叮到！”',

'xxx期：幼儿园老师为了测试学生的分析判断能力，问道：“如果有一个男童的右颊肿了，你认为到底是为什么呢？”静了一会儿，小宝站起答道：“不是他牙痛，就是他爸爸是左撇子。”',

'xxx期：今天我的一学生用饭卡当尺子作图被我看见，于是就走过去问：同学你没钱么？你是没有钱么？（意思就是让他买把尺子的）。结果等我转了一圈回到原地，发现那位神兄拿着银行卡在默默地画着。。。',
'xxx期：大学的时候，刚进学校。学校让我们填一份自我简介，里面包括体育强项。同桌告诉我不要写那种运动会用的到的项目，不然以后运动会会强迫你参加。于是我们写的是高尔夫、网球、滑雪之类的，本想转过身去提醒后面玩的好的男生，结果一看他写的体育强项是双脚踩灯泡、胸口碎大石',

'xxx期：“某男和女友摊牌， 女：给我个分手的理由。 男：我们不合适。 女：哪儿不合适？ 男：性别不合适 。”',
'xxx期：一程序员去面试，面试官问：“你毕业才两年，这三年经验是怎么来的？！”程序员：“加班。”',

'xxx期：生物课，大家都知道男性的性染色体是XY，女性的是XX。老师说现在临床上已经发现五个X染色体的女 性。一同学问：那她是啥性别啊?阴影的角落传来低沉的声音：超级女生',

'xxx期：中国最有名气的两个摄影爱好者，一个名叫周正龙，喜欢照老虎；一个名叫魏文华，喜欢照城管。这两个摄影爱好者的下场。周正龙照虎，活着；魏文华照城管，死了。这两位勇敢的人儿为我们证明了：城管猛于虎',

'xxx期：去年在印度出差，一印度朋友问我在中国自己买一片土地建一栋楼要多少钱。我说在中国土地是国家的，我们买的房子只有七十年的产权。他一脸茫然的说，你们中国人奋斗一生最终连一块属于自己的土地都没有，你们到底为什么而忙碌？我无言以对，沉默很久后咬牙切齿狠狠的答道:为共产主义奋斗终生!',

'xxx期：考不上研的话，就要回老家种地：没鞋穿，脚指甲缝都是黑的；时不时还会被村干部拉进玉米地里做先进性教育；晚上被老公吊到梁上打一顿；家里不通电，吃窝头度日；套套也买不起，用猪大肠代替，一身是病······好了，不想了，继续看书复习，今年一定得考上',
'xxx期：鲁豫采访精神病院院长时，问其怎样精准确定病人已经治愈?并可以让其出院。院长说：“很简单，把浴缸注满水，旁边放一把汤匙和一把舀勺，要求把浴缸腾空。”鲁豫说：“真的么？哦，天哪！正常的人应该使用舀勺。院长说：“不，正常已治愈的会把浴缸的塞子拔掉 !',

`xxx期：某天去领导家，看见有一个小孩坐在一个门口玩耍，问他：“你爸爸在家吗？”小孩答曰：“在家”， 咱就屁颠屁颠去按门铃，按了很久，无人开门。气得我火冒三丈，生气地问：“为啥不开门？”小男孩答：“我哪知道，这又不是我家！`,

`xxx期：一直在外边住单身公寓,许久没有回家吃饭了。昨晚上一回到家,老妈就拼命往我碗里夹红烧肉,一脸心疼地说：“儿子,多吃点儿,看把你瘦的！”还是家里最温暖啊！我含着泪花对妈妈说：“太好吃了,妈,你给我爸夹点吃吧！”老爸坐在一边,幽幽地说：“我不吃昨天的剩菜！”`,

`xxx期：前几天跑表哥家去玩,开着我两百多万买的兰博基尼,一路火花带闪电的就到了,谁知道表哥竟然不在,于是我就问我哥去哪了,嫂子回答：“又遛狗去了！买了条藏獒,宝贝的要命,每天吃过晚饭兴致勃勃的去遛狗！带孩子都没有这么积极！”我当时嘴欠,脑子一抽来了一句：“我哥多聪明啊,狗狗不会说话啊,孩子回家会打小报告！”然后我就看到嫂子连视频都没来得及关,匆匆的出门了……`,

`xxx期：城里一个年轻漂亮的女士很讲究饮食，特别喜欢吃红薯叶。一次去乡下探亲，还特意买了几捆红薯叶带给亲戚分享。在分发时还大声说：“这可是绿色食品，食用后有益身体健康，城里人都很爱吃的。小孩接过红薯叶后就扔给猪吃了，“大姐姐，我们这里的红薯叶一般是拿来喂猪的。`,

`xxx期：家里的煤气罐用完了,然后把空煤气罐绑在摩托车后面就骑着车,经过路口等红绿灯,一骑摩托车哥们旁边停下“哥们,你摩托车在哪改的气啊”!尼玛,你眼有木有毛病啊!`,

`xxx期：隔壁网咖的特别卡,网吧老板打电话给我让我去看看！结果遇到了前女友的儿子,他来上网,身上只有一块钱！网吧老板一直跟他解释说钱不够,我就帮他给了钱！今天路过前女友家,头顶突然传来一句：“叔叔！”我刚抬头看上去,突然哗啦一声,全身都湿透了！抬头就看到那个小孩拿着一个盆说：“我妈妈说过,滴水之恩应当涌泉相报！”`,

`xxx期：有个帅哥，他的女邻居长得非常丑。女邻居为了自嘲，将蓝牙用户名命名为“一头母猪”。女邻居频频向帅哥表达爱意，这让帅哥十分苦恼。这天，女邻居硬要通过手机蓝牙发自己的艺术照给帅哥看。帅哥执拗不过，就打开蓝牙，结果他后悔至极，因为女邻居发送照片时，系统的提示是：一头母猪要和你配对。`,

`xxx期：同事一家三口爬山,回来的时候鼻青脸肿的,问怎么回事。他说：在山上看到一只小松鼠,我立马伸手从口袋里掏出弹弓,可我女儿严厉的说：爸爸,把你的弹弓给我装起来,小动物也是有生命的！如果我妈妈死了,你是不是也会很难过？我一时没忍住笑出了声,被你嫂子当场就给揍了！`,

`xxx期：小时候经常被同桌欺负,终于有一天我忍无可忍了,于是我说：你再这样我就告老师了,他说：无所谓,你爱告不告。然后我举起了手,结果,老师说：这位同学算得真快,你来做这道题吧。`,

`xxx期：单位新来个女员工,又矮又胖,还比较能开玩笑。她蹲下系鞋带,一同事涮她说,这家伙,蹲下整个一个坐地炮啊,那女的说你积点口德,我也过去义正词严的批评这同事：就是,怎么能这么说人家呢,人家能爱听吗？又细又长的才叫炮,这分明是地雷嘛！`,

`xxx期：昨天晚上在家洗澡时,耳朵不小心里进了水,耳洞里湿湿得难受,出来我歪着脑袋向下倒,老公看到了走到跟前,皱着眉头拉我躺在沙发上,用棉签帮我沾干,还不无担忧的说:媳妇儿,耳朵进水了我能帮你弄干净,但你脑子里进的水,我是真没办法了。`,

'xxx期：吃饭时，12岁的儿子突然小声问我：“妈妈，我想问你一个小问题！”“说吧”我好奇的看着他，心想这小把戏能问啥幼稚问题。“你知道ML是什么意思吗？”……我K，我心一惊：“我也不太清楚，可能是一个品牌商标的名字。”他得意的拿出个饮料瓶说：“ml就是毫升嘛，妈妈好笨！”'
];

module.exports = xiaoHua;